In [1]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv(r'/home/jagdeep/Desktop/LetsUpgrade/Dataset/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

__Q.1 How many movies are listed in the titles dataframe?__

In [5]:
total_rows = len(titles.axes[0])
total_cols = len(titles.axes[1])
print("Number of Rows :"+str(total_rows))
print("Number of Columns :"+str(total_cols))
print("Total movies are listed in the titles dataframe :", total_rows)

Number of Rows :244914
Number of Columns :2
Total movies are listed in the titles dataframe : 244914

In [7]:
titles.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
244909  False  False
244910  False  False
244911  False  False
244912  False  False
244913  False  False

[244914 rows x 2 columns]

In [8]:
titles.isnull().sum().sum()

0

__Q.2 What are the earliest two films listed in the tiles dataframe?__

In [30]:
titles.head(None)
#finding mini and max
print ("min value element : ", titles.min(axis=0)[1])
# print ("max value element : ", my_data.max(axis=0)[2])
# print("Earliest two films :")
result_sort=titles.sort_values(by=['year', 'title'], ascending=[True, True])
print("Sort the data frame ‘year’ in ascending order:")
print(result_sort)

min value element :  1894
Sort the data frame ‘year’ in ascending order:
                                                 title  year
193222                                      Miss Jerry  1894
51388                               The Startled Lover  1898
4584    Reproduction of the Corbett and Jeffries Fight  1899
108586                            Family Troubles (II)  1900
219198                                  May Day Parade  1900
...                                                ...   ...
217349                               The Dreams I Have  2024
224450                                    War in Black  2024
34213                                         Avatar 5  2025
183018                        The Zero Century: Maetel  2026
242196                                       100 Years  2115

[244914 rows x 2 columns]

In [35]:
#Answer
df=result_sort
print("The earliest two films listed in the tiles dataframe are :\n", df.head(2))

The earliest two films listed in the tiles dataframe are :
                      title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

__Q.3 How many movies have the title "Hamlet"?__

In [76]:
# df = pd.read_csv('file')
s = titles['title'].value_counts().rename('Total_GeneralID')
title1 = titles.join(s, on='title')
print (title1)

                                      title  year  Total_GeneralID
0                        Tasveer Mere Sanam  1996                1
1                                  Only You  1994                3
2                      El pueblo del terror  1970                1
3                                   Machine  2007                2
4                                      MARy  2008                1
...                                     ...   ...              ...
244909  Black Butterfly in a Colorful World  2018                1
244910        Hua fei hua wu chun man cheng  1980                1
244911                 Nippon dabi katsukyu  1970                1
244912        Under Siege 2: Dark Territory  1995                1
244913            She Must Be Seeing Things  1987                1

[244914 rows x 3 columns]

In [85]:
result_sort=title1.sort_values(by=['Total_GeneralID', 'title','year'], ascending=[True, True, True])
print(result_sort)
df11=result_sort
print(df11.tail(1),"movies have the title Hamlet\n")

print("20 movies have the title Hamlet\n")

                   title  year  Total_GeneralID
93917   #1 Serial Killer  2013                1
98963               #211  2018                1
23496                 #5  2013                1
239101        #50Fathers  2015                1
220852               #66  2015                1
...                  ...   ...              ...
173033            Hamlet  2011               20
202025            Hamlet  2014               20
154029            Hamlet  2015               20
88065             Hamlet  2016               20
6422              Hamlet  2017               20

[244914 rows x 3 columns]
       title  year  Total_GeneralID
6422  Hamlet  2017               20 movies have the title Hamlet

20 movies have the title Hamlet

__Q. How many movies are titled "North by Northwest"?__

In [17]:
# movie = titles.groupby('title').size().sort_values(ascending=False)[:55]
titles.query('title == "North by Northwest"').title.count()
print("The titled North by Northwest movie is :", titles.query('title == "North by Northwest"').title.count()
)

The titled North by Northwest movie is : 1

__Q. When was the first movie titled "Hamlet" made?__

In [38]:
firstMovie=titles[titles.title == "Hamlet"][:20]
firstMovie.sort_values(["title", "year"], axis=0, 
                 ascending=True, inplace=True) 
print("The first movie titled Hamlet made :",firstMovie.head(1))

The first movie titled Hamlet made :         title  year
52521  Hamlet  1910

__Q. List all of the "Treasure Island" movies from earliest to most recent.__

In [42]:
SecondMovie=titles[titles.title == "Treasure Island"][:10]
SecondMovie

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

In [39]:
# titles.query('title == "Treasure Island"').title.count()

8

__Q. How many movies were made in the year 1950?__

In [44]:
titles.query('year == "1950"').year.count()

1113

__Q. How many movies were made in the year 1960?__

In [46]:
titles.query('year == "1960"').year.count()

1549

__Q. How many movies were made from 1950 through 1959?__

In [57]:
t1=titles.query('year == "1950"').year.count()
print("1950 :",t1)
t2=titles.query('year == "1951"').year.count()
print("1951 :",t2)
t3=titles.query('year == "1952"').year.count()
print("1952 :",t3)
t4=titles.query('year == "1953"').year.count()
print("1953 :",t4)
t5=titles.query('year == "1954"').year.count()
print("1954 :",t5)
t6=titles.query('year == "1955"').year.count()
print("1955 :",t6)
t7=titles.query('year == "1956"').year.count()
print("1956 :",t7)
t8=titles.query('year == "1957"').year.count()
print("1957 :",t8)
t9=titles.query('year == "1958"').year.count()
print("1958 :",t9)
t10=titles.query('year == "1959"').year.count()
print("1959 :",t10)

result=t1+t2+t3+t4+t5+t6+t7+t8+t9+t10
print("Total movies were made from 1950 through 1959 is =", result)

1950 : 1113
1951 : 1165
1952 : 1159
1953 : 1210
1954 : 1235
1955 : 1262
1956 : 1341
1957 : 1437
1958 : 1497
1959 : 1515
Total movies were made from 1950 through 1959 is = 12934

__Q. In what years has a movie titled "Batman" been released?__

In [58]:
Batman=titles[titles.title == "Batman"][:1]
Batman

        title  year
39349  Batman  1943

__Q. How many roles were there in the movie "Inception"?__

In [62]:
Inception=titles[titles.title == "Inception"][:10]
Inception

            title  year
183910  Inception  2010

In [63]:
titles.query('title == "Inception"').title.count()

1

In [ ]:
titles = pd.read_csv(r'/home/jagdeep/Desktop/LetsUpgrade/Dataset/cast.csv')
titles.head()